[
  {
    "company": "Trovr",
    "date": "Feb 2024 - Present",
    "description": [
      "Spearheading the frontend development efforts for a mobile app using React Native.",
      "Collaborating on the design and implementation of RESTful APIs using OpenAPI specifications.",
      "Creating a comprehensive testing strategy using Jest and MSW to ensure the reliability of the app.",
      "Working with the team to implement CI/CD pipelines to automate the deployment process.",
      "Contributing to the development of a design system to ensure a consistent user experience across the app."
    ],
    "link": "https://trovrapp.com/",
    "position": "Front End Developer",
    "technologies": ["React Native", "TS", "Jest", "MSW"]
  },
  {
    "company": "Siadat Software",
    "date": "Oct 2023 - Dec 2023",
    "description": [
      "Worked on MLOps, contributing to the implementation of solutions for efficient model deployment and data processing. Built applications using Python, Angular and SCSS."
    ],
    "link": "https://siadat.com/",
    "position": "Full-stack Developer",
    "technologies": ["Python", "TS", "Angular", "SCSS", "AWS"]
  },
  {
    "company": "CU Boulder",
    "date": "Mar 2022 - May 2023",
    "description": [
      "Contributed to the creation and maintenance of multiple different natural language processing datasets for use in research by the Computational Linguistics Department."
    ],
    "link": null,
    "position": "Machine Learning Annotator",
    "technologies": []
  },
  {
    "company": "CU Boulder",
    "date": "Aug 2021 - Dec 2021",
    "description": [
      "Graded homework and exams for over 100 students. Ran group and individual sessions to tutor students and answer their questions."
    ],
    "link": null,
    "position": "Computer Science Grader",
    "technologies": []
  },
  {
    "company": "Fiverr.com",
    "date": "May 2016 - Jul 2021",
    "description": [
      "Grew a successful online store on fiverr.com, offering graphic design services and working with over 1000 individuals and brands, amassing over 1100 orders and 900 5-star reviews in the process."
    ],
    "link": "https://www.fiverr.com/martinbartolo",
    "position": "Freelance Graphic Designer",
    "technologies": ["Adobe Photoshop", "Adobe Illustrator"]
  }
]
